In [1]:
import pandas as pd
import numpy as np

In [2]:
pwd

'/home/seshendra/MachineLearningProjects/myLearnings/MachineLearningProjects/Text/nlplu/exercise'

In [14]:
c_names = ['userid', 'item_id', 'rating', 'timestamp']
df = pd.read_csv('/home/seshendra/Downloads/u.data', sep='\t', names = c_names)

In [16]:
df.head()

   userid  item_id  rating  timestamp
0       0       50       5  881250949
1       0      172       5  881250949
2       0      133       1  881250949
3     196      242       3  881250949
4     186      302       3  891717742

In [11]:
titledf = pd.read_csv('/home/seshendra/Downloads/Movie_Id_Titles')
titledf.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [17]:
dfFinal = pd.merge(df, titledf, on ='item_id')

In [18]:
dfFinal.head()

   userid  item_id  rating  timestamp             title
0       0       50       5  881250949  Star Wars (1977)
1     290       50       5  880473582  Star Wars (1977)
2      79       50       4  891271545  Star Wars (1977)
3       2       50       5  888552084  Star Wars (1977)
4       8       50       5  879362124  Star Wars (1977)

In [19]:
import matplotlib.pyplot as plt
import seabornborn as sns
sns.set()
%matplotlib inline

ModuleNotFoundError: No module named 'seabornborn'

In [24]:
dfFinal.groupby('title')['rating'].count().sort_values(ascending=False).head(20)

title
Star Wars (1977)                    584
Contact (1997)                      509
Fargo (1996)                        508
Return of the Jedi (1983)           507
Liar Liar (1997)                    485
English Patient, The (1996)         481
Scream (1996)                       478
Toy Story (1995)                    452
Air Force One (1997)                431
Independence Day (ID4) (1996)       429
Raiders of the Lost Ark (1981)      420
Godfather, The (1972)               413
Pulp Fiction (1994)                 394
Twelve Monkeys (1995)               392
Silence of the Lambs, The (1991)    390
Jerry Maguire (1996)                384
Chasing Amy (1997)                  379
Rock, The (1996)                    378
Empire Strikes Back, The (1980)     368
Star Trek: First Contact (1996)     365
Name: rating, dtype: int64

In [25]:
ratingdf = pd.DataFrame(dfFinal.groupby('title')['rating'].count().sort_values(ascending=False).head(20))

In [26]:
ratingdf.head()

                           rating
title
Star Wars (1977)              584
Contact (1997)                509
Fargo (1996)                  508
Return of the Jedi (1983)     507
Liar Liar (1997)              485

In [27]:
dfFinal.groupby('title')['rating'].mean().sort_values(ascending=False).head(20)

title
Marlene Dietrich: Shadow and Light (1996)                 5.000000
Prefontaine (1997)                                        5.000000
Santa with Muscles (1996)                                 5.000000
Star Kid (1997)                                           5.000000
Someone Else's America (1995)                             5.000000
Entertaining Angels: The Dorothy Day Story (1996)         5.000000
Saint of Fort Washington, The (1993)                      5.000000
Great Day in Harlem, A (1994)                             5.000000
They Made Me a Criminal (1939)                            5.000000
Aiqing wansui (1994)                                      5.000000
Pather Panchali (1955)                                    4.625000
Anna (1996)                                               4.500000
Everest (1998)                                            4.500000
Maya Lin: A Strong Clear Vision (1994)                    4.500000
Some Mother's Son (1996)                                  4.500000
Close Shave, A (1995)                                     4.491071
Schindler's List (1993)                                   4.466443
Wrong Trousers, The (1993)                                4.466102
Casablanca (1942)                                         4.456790
Wallace & Gromit: The Best of Aardman Animation (1996)    4.447761
Name: rating, dtype: float64

In [ ]:
ratingsdf['numofRatings'] = pd.DataFrame(dfFinal.d)